ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
/*
 * Component description for RTC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_RTC_COMPONENT_H_
#define _SAMD21_RTC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR RTC                                          */
/* ************************************************************************** */

/* -------- RTC_MODE0_CTRL : (RTC Offset: 0x00) (R/W 16) MODE0 Control -------- */
#define RTC_MODE0_CTRL_RESETVALUE _UINT16_(0x00) /*  (RTC_MODE0_CTRL) MODE0 Control  Reset Value */

#define RTC_MODE0_CTRL_SWRST_Pos _UINT16_(0) /* (RTC_MODE0_CTRL) Software Reset Position */
#define RTC_MODE0_CTRL_SWRST_Msk (_UINT16_(0x1) << RTC_MODE0_CTRL_SWRST_Pos) /* (RTC_MODE0_CTRL) Software Reset Mask   \
                                                                              */
#define RTC_MODE0_CTRL_SWRST(value)                                                                                    \
        (RTC_MODE0_CTRL_SWRST_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE0_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the RTC_MODE0_CTRL register */
#define RTC_MODE0_CTRL_ENABLE_Pos _UINT16_(1) /* (RTC_MODE0_CTRL) Enable Position */
#define RTC_MODE0_CTRL_ENABLE_Msk (_UINT16_(0x1) << RTC_MODE0_CTRL_ENABLE_Pos) /* (RTC_MODE0_CTRL) Enable Mask */
#define RTC_MODE0_CTRL_ENABLE(value)                                                                                   \
        (RTC_MODE0_CTRL_ENABLE_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE0_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the RTC_MODE0_CTRL register */
#define RTC_MODE0_CTRL_MODE_Pos _UINT16_(2) /* (RTC_MODE0_CTRL) Operating Mode Position */
#define RTC_MODE0_CTRL_MODE_Msk (_UINT16_(0x3) << RTC_MODE0_CTRL_MODE_Pos) /* (RTC_MODE0_CTRL) Operating Mode Mask */
#define RTC_MODE0_CTRL_MODE(value)                                                                                     \
        (RTC_MODE0_CTRL_MODE_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE0_CTRL_MODE_Pos)) /* Assigment of value for MODE in the RTC_MODE0_CTRL register */
#define RTC_MODE0_CTRL_MODE_COUNT32_Val _UINT16_(0x0) /* (RTC_MODE0_CTRL) Mode 0: 32-bit Counter  */
#define RTC_MODE0_CTRL_MODE_COUNT16_Val _UINT16_(0x1) /* (RTC_MODE0_CTRL) Mode 1: 16-bit Counter  */
#define RTC_MODE0_CTRL_MODE_CLOCK_Val _UINT16_(0x2) /* (RTC_MODE0_CTRL) Mode 2: Clock/Calendar  */
#define RTC_MODE0_CTRL_MODE_COUNT32                                                                                    \
        (                                                                                                              \
                RTC_MODE0_CTRL_MODE_COUNT32_Val                                                                        \
                << RTC_MODE0_CTRL_MODE_Pos) /* (RTC_MODE0_CTRL) Mode 0: 32-bit Counter Position  */
#define RTC_MODE0_CTRL_MODE_COUNT16                                                                                    \
        (                                                                                                              \
                RTC_MODE0_CTRL_MODE_COUNT16_Val                                                                        \
                << RTC_MODE0_CTRL_MODE_Pos) /* (RTC_MODE0_CTRL) Mode 1: 16-bit Counter Position  */
#define RTC_MODE0_CTRL_MODE_CLOCK                                                                                      \
        (                                                                                                              \
                RTC_MODE0_CTRL_MODE_CLOCK_Val                                                                          \
                << RTC_MODE0_CTRL_MODE_Pos) /* (RTC_MODE0_CTRL) Mode 2: Clock/Calendar Position  */
#define RTC_MODE0_CTRL_MATCHCLR_Pos _UINT16_(7) /* (RTC_MODE0_CTRL) Clear on Match Position */
#define RTC_MODE0_CTRL_MATCHCLR_Msk                                                                                    \
        (_UINT16_(0x1) << RTC_MODE0_CTRL_MATCHCLR_Pos) /* (RTC_MODE0_CTRL) Clear on Match Mask */
#define RTC_MODE0_CTRL_MATCHCLR(value)                                                                                 \
        (RTC_MODE0_CTRL_MATCHCLR_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE0_CTRL_MATCHCLR_Pos)) /* Assigment of value for MATCHCLR in the RTC_MODE0_CTRL register */
#define RTC_MODE0_CTRL_PRESCALER_Pos _UINT16_(8) /* (RTC_MODE0_CTRL) Prescaler Position */
#define RTC_MODE0_CTRL_PRESCALER_Msk                                                                                   \
        (_UINT16_(0xF) << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) Prescaler Mask */
#define RTC_MODE0_CTRL_PRESCALER(value)                                                                                \
        (RTC_MODE0_CTRL_PRESCALER_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE0_CTRL_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the RTC_MODE0_CTRL register */
#define RTC_MODE0_CTRL_PRESCALER_DIV1_Val _UINT16_(0x0) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/1  */
#define RTC_MODE0_CTRL_PRESCALER_DIV2_Val _UINT16_(0x1) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/2  */
#define RTC_MODE0_CTRL_PRESCALER_DIV4_Val _UINT16_(0x2) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/4  */
#define RTC_MODE0_CTRL_PRESCALER_DIV8_Val _UINT16_(0x3) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/8  */
#define RTC_MODE0_CTRL_PRESCALER_DIV16_Val _UINT16_(0x4) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/16  */
#define RTC_MODE0_CTRL_PRESCALER_DIV32_Val _UINT16_(0x5) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/32  */
#define RTC_MODE0_CTRL_PRESCALER_DIV64_Val _UINT16_(0x6) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/64  */
#define RTC_MODE0_CTRL_PRESCALER_DIV128_Val _UINT16_(0x7) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/128  */
#define RTC_MODE0_CTRL_PRESCALER_DIV256_Val _UINT16_(0x8) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/256  */
#define RTC_MODE0_CTRL_PRESCALER_DIV512_Val _UINT16_(0x9) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/512  */
#define RTC_MODE0_CTRL_PRESCALER_DIV1024_Val _UINT16_(0xA) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/1024  */
#define RTC_MODE0_CTRL_PRESCALER_DIV1                                                                                  \
        (RTC_MODE0_CTRL_PRESCALER_DIV1_Val                                                                             \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/1 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV2                                                                                  \
        (RTC_MODE0_CTRL_PRESCALER_DIV2_Val                                                                             \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/2 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV4                                                                                  \
        (RTC_MODE0_CTRL_PRESCALER_DIV4_Val                                                                             \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/4 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV8                                                                                  \
        (RTC_MODE0_CTRL_PRESCALER_DIV8_Val                                                                             \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/8 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV16                                                                                 \
        (RTC_MODE0_CTRL_PRESCALER_DIV16_Val                                                                            \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/16 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV32                                                                                 \
        (RTC_MODE0_CTRL_PRESCALER_DIV32_Val                                                                            \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/32 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV64                                                                                 \
        (RTC_MODE0_CTRL_PRESCALER_DIV64_Val                                                                            \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/64 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV128                                                                                \
        (RTC_MODE0_CTRL_PRESCALER_DIV128_Val                                                                           \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/128 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV256                                                                                \
        (RTC_MODE0_CTRL_PRESCALER_DIV256_Val                                                                           \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/256 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV512                                                                                \
        (RTC_MODE0_CTRL_PRESCALER_DIV512_Val                                                                           \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/512 Position  */
#define RTC_MODE0_CTRL_PRESCALER_DIV1024                                                                               \
        (RTC_MODE0_CTRL_PRESCALER_DIV1024_Val                                                                          \
         << RTC_MODE0_CTRL_PRESCALER_Pos) /* (RTC_MODE0_CTRL) CLK_RTC_CNT = GCLK_RTC/1024 Position  */
#define RTC_MODE0_CTRL_Msk _UINT16_(0x0F8F) /* (RTC_MODE0_CTRL) Register Mask  */


/* -------- RTC_MODE1_CTRL : (RTC Offset: 0x00) (R/W 16) MODE1 Control -------- */
#define RTC_MODE1_CTRL_RESETVALUE _UINT16_(0x00) /*  (RTC_MODE1_CTRL) MODE1 Control  Reset Value */

#define RTC_MODE1_CTRL_SWRST_Pos _UINT16_(0) /* (RTC_MODE1_CTRL) Software Reset Position */
#define RTC_MODE1_CTRL_SWRST_Msk (_UINT16_(0x1) << RTC_MODE1_CTRL_SWRST_Pos) /* (RTC_MODE1_CTRL) Software Reset Mask   \
                                                                              */
#define RTC_MODE1_CTRL_SWRST(value)                                                                                    \
        (RTC_MODE1_CTRL_SWRST_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE1_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the RTC_MODE1_CTRL register */
#define RTC_MODE1_CTRL_ENABLE_Pos _UINT16_(1) /* (RTC_MODE1_CTRL) Enable Position */
#define RTC_MODE1_CTRL_ENABLE_Msk (_UINT16_(0x1) << RTC_MODE1_CTRL_ENABLE_Pos) /* (RTC_MODE1_CTRL) Enable Mask */
#define RTC_MODE1_CTRL_ENABLE(value)                                                                                   \
        (RTC_MODE1_CTRL_ENABLE_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE1_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the RTC_MODE1_CTRL register */
#define RTC_MODE1_CTRL_MODE_Pos _UINT16_(2) /* (RTC_MODE1_CTRL) Operating Mode Position */
#define RTC_MODE1_CTRL_MODE_Msk (_UINT16_(0x3) << RTC_MODE1_CTRL_MODE_Pos) /* (RTC_MODE1_CTRL) Operating Mode Mask */
#define RTC_MODE1_CTRL_MODE(value)                                                                                     \
        (RTC_MODE1_CTRL_MODE_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE1_CTRL_MODE_Pos)) /* Assigment of value for MODE in the RTC_MODE1_CTRL register */
#define RTC_MODE1_CTRL_MODE_COUNT32_Val _UINT16_(0x0) /* (RTC_MODE1_CTRL) Mode 0: 32-bit Counter  */
#define RTC_MODE1_CTRL_MODE_COUNT16_Val _UINT16_(0x1) /* (RTC_MODE1_CTRL) Mode 1: 16-bit Counter  */
#define RTC_MODE1_CTRL_MODE_CLOCK_Val _UINT16_(0x2) /* (RTC_MODE1_CTRL) Mode 2: Clock/Calendar  */
#define RTC_MODE1_CTRL_MODE_COUNT32                                                                                    \
        (                                                                                                              \
                RTC_MODE1_CTRL_MODE_COUNT32_Val                                                                        \
                << RTC_MODE1_CTRL_MODE_Pos) /* (RTC_MODE1_CTRL) Mode 0: 32-bit Counter Position  */
#define RTC_MODE1_CTRL_MODE_COUNT16                                                                                    \
        (                                                                                                              \
                RTC_MODE1_CTRL_MODE_COUNT16_Val                                                                        \
                << RTC_MODE1_CTRL_MODE_Pos) /* (RTC_MODE1_CTRL) Mode 1: 16-bit Counter Position  */
#define RTC_MODE1_CTRL_MODE_CLOCK                                                                                      \
        (                                                                                                              \
                RTC_MODE1_CTRL_MODE_CLOCK_Val                                                                          \
                << RTC_MODE1_CTRL_MODE_Pos) /* (RTC_MODE1_CTRL) Mode 2: Clock/Calendar Position  */
#define RTC_MODE1_CTRL_PRESCALER_Pos _UINT16_(8) /* (RTC_MODE1_CTRL) Prescaler Position */
#define RTC_MODE1_CTRL_PRESCALER_Msk                                                                                   \
        (_UINT16_(0xF) << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) Prescaler Mask */
#define RTC_MODE1_CTRL_PRESCALER(value)                                                                                \
        (RTC_MODE1_CTRL_PRESCALER_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE1_CTRL_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the RTC_MODE1_CTRL register */
#define RTC_MODE1_CTRL_PRESCALER_DIV1_Val _UINT16_(0x0) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/1  */
#define RTC_MODE1_CTRL_PRESCALER_DIV2_Val _UINT16_(0x1) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/2  */
#define RTC_MODE1_CTRL_PRESCALER_DIV4_Val _UINT16_(0x2) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/4  */
#define RTC_MODE1_CTRL_PRESCALER_DIV8_Val _UINT16_(0x3) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/8  */
#define RTC_MODE1_CTRL_PRESCALER_DIV16_Val _UINT16_(0x4) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/16  */
#define RTC_MODE1_CTRL_PRESCALER_DIV32_Val _UINT16_(0x5) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/32  */
#define RTC_MODE1_CTRL_PRESCALER_DIV64_Val _UINT16_(0x6) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/64  */
#define RTC_MODE1_CTRL_PRESCALER_DIV128_Val _UINT16_(0x7) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/128  */
#define RTC_MODE1_CTRL_PRESCALER_DIV256_Val _UINT16_(0x8) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/256  */
#define RTC_MODE1_CTRL_PRESCALER_DIV512_Val _UINT16_(0x9) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/512  */
#define RTC_MODE1_CTRL_PRESCALER_DIV1024_Val _UINT16_(0xA) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/1024  */
#define RTC_MODE1_CTRL_PRESCALER_DIV1                                                                                  \
        (RTC_MODE1_CTRL_PRESCALER_DIV1_Val                                                                             \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/1 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV2                                                                                  \
        (RTC_MODE1_CTRL_PRESCALER_DIV2_Val                                                                             \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/2 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV4                                                                                  \
        (RTC_MODE1_CTRL_PRESCALER_DIV4_Val                                                                             \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/4 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV8                                                                                  \
        (RTC_MODE1_CTRL_PRESCALER_DIV8_Val                                                                             \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/8 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV16                                                                                 \
        (RTC_MODE1_CTRL_PRESCALER_DIV16_Val                                                                            \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/16 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV32                                                                                 \
        (RTC_MODE1_CTRL_PRESCALER_DIV32_Val                                                                            \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/32 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV64                                                                                 \
        (RTC_MODE1_CTRL_PRESCALER_DIV64_Val                                                                            \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/64 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV128                                                                                \
        (RTC_MODE1_CTRL_PRESCALER_DIV128_Val                                                                           \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/128 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV256                                                                                \
        (RTC_MODE1_CTRL_PRESCALER_DIV256_Val                                                                           \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/256 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV512                                                                                \
        (RTC_MODE1_CTRL_PRESCALER_DIV512_Val                                                                           \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/512 Position  */
#define RTC_MODE1_CTRL_PRESCALER_DIV1024                                                                               \
        (RTC_MODE1_CTRL_PRESCALER_DIV1024_Val                                                                          \
         << RTC_MODE1_CTRL_PRESCALER_Pos) /* (RTC_MODE1_CTRL) CLK_RTC_CNT = GCLK_RTC/1024 Position  */
#define RTC_MODE1_CTRL_Msk _UINT16_(0x0F0F) /* (RTC_MODE1_CTRL) Register Mask  */


