ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
/* -------- RTC_MODE2_CTRL : (RTC Offset: 0x00) (R/W 16) MODE2 Control -------- */
#define RTC_MODE2_CTRL_RESETVALUE _UINT16_(0x00) /*  (RTC_MODE2_CTRL) MODE2 Control  Reset Value */

#define RTC_MODE2_CTRL_SWRST_Pos _UINT16_(0) /* (RTC_MODE2_CTRL) Software Reset Position */
#define RTC_MODE2_CTRL_SWRST_Msk (_UINT16_(0x1) << RTC_MODE2_CTRL_SWRST_Pos) /* (RTC_MODE2_CTRL) Software Reset Mask   \
                                                                              */
#define RTC_MODE2_CTRL_SWRST(value)                                                                                    \
        (RTC_MODE2_CTRL_SWRST_Msk &                                                                                    \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_CTRL_SWRST_Pos)) /* Assigment of value for SWRST in the RTC_MODE2_CTRL register */
#define RTC_MODE2_CTRL_ENABLE_Pos _UINT16_(1) /* (RTC_MODE2_CTRL) Enable Position */
#define RTC_MODE2_CTRL_ENABLE_Msk (_UINT16_(0x1) << RTC_MODE2_CTRL_ENABLE_Pos) /* (RTC_MODE2_CTRL) Enable Mask */
#define RTC_MODE2_CTRL_ENABLE(value)                                                                                   \
        (RTC_MODE2_CTRL_ENABLE_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the RTC_MODE2_CTRL register */
#define RTC_MODE2_CTRL_MODE_Pos _UINT16_(2) /* (RTC_MODE2_CTRL) Operating Mode Position */
#define RTC_MODE2_CTRL_MODE_Msk (_UINT16_(0x3) << RTC_MODE2_CTRL_MODE_Pos) /* (RTC_MODE2_CTRL) Operating Mode Mask */
#define RTC_MODE2_CTRL_MODE(value)                                                                                     \
        (RTC_MODE2_CTRL_MODE_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_CTRL_MODE_Pos)) /* Assigment of value for MODE in the RTC_MODE2_CTRL register */
#define RTC_MODE2_CTRL_MODE_COUNT32_Val _UINT16_(0x0) /* (RTC_MODE2_CTRL) Mode 0: 32-bit Counter  */
#define RTC_MODE2_CTRL_MODE_COUNT16_Val _UINT16_(0x1) /* (RTC_MODE2_CTRL) Mode 1: 16-bit Counter  */
#define RTC_MODE2_CTRL_MODE_CLOCK_Val _UINT16_(0x2) /* (RTC_MODE2_CTRL) Mode 2: Clock/Calendar  */
#define RTC_MODE2_CTRL_MODE_COUNT32                                                                                    \
        (                                                                                                              \
                RTC_MODE2_CTRL_MODE_COUNT32_Val                                                                        \
                << RTC_MODE2_CTRL_MODE_Pos) /* (RTC_MODE2_CTRL) Mode 0: 32-bit Counter Position  */
#define RTC_MODE2_CTRL_MODE_COUNT16                                                                                    \
        (                                                                                                              \
                RTC_MODE2_CTRL_MODE_COUNT16_Val                                                                        \
                << RTC_MODE2_CTRL_MODE_Pos) /* (RTC_MODE2_CTRL) Mode 1: 16-bit Counter Position  */
#define RTC_MODE2_CTRL_MODE_CLOCK                                                                                      \
        (                                                                                                              \
                RTC_MODE2_CTRL_MODE_CLOCK_Val                                                                          \
                << RTC_MODE2_CTRL_MODE_Pos) /* (RTC_MODE2_CTRL) Mode 2: Clock/Calendar Position  */
#define RTC_MODE2_CTRL_CLKREP_Pos _UINT16_(6) /* (RTC_MODE2_CTRL) Clock Representation Position */
#define RTC_MODE2_CTRL_CLKREP_Msk                                                                                      \
        (_UINT16_(0x1) << RTC_MODE2_CTRL_CLKREP_Pos) /* (RTC_MODE2_CTRL) Clock Representation Mask */
#define RTC_MODE2_CTRL_CLKREP(value)                                                                                   \
        (RTC_MODE2_CTRL_CLKREP_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_CTRL_CLKREP_Pos)) /* Assigment of value for CLKREP in the RTC_MODE2_CTRL register */
#define RTC_MODE2_CTRL_MATCHCLR_Pos _UINT16_(7) /* (RTC_MODE2_CTRL) Clear on Match Position */
#define RTC_MODE2_CTRL_MATCHCLR_Msk                                                                                    \
        (_UINT16_(0x1) << RTC_MODE2_CTRL_MATCHCLR_Pos) /* (RTC_MODE2_CTRL) Clear on Match Mask */
#define RTC_MODE2_CTRL_MATCHCLR(value)                                                                                 \
        (RTC_MODE2_CTRL_MATCHCLR_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_CTRL_MATCHCLR_Pos)) /* Assigment of value for MATCHCLR in the RTC_MODE2_CTRL register */
#define RTC_MODE2_CTRL_PRESCALER_Pos _UINT16_(8) /* (RTC_MODE2_CTRL) Prescaler Position */
#define RTC_MODE2_CTRL_PRESCALER_Msk                                                                                   \
        (_UINT16_(0xF) << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) Prescaler Mask */
#define RTC_MODE2_CTRL_PRESCALER(value)                                                                                \
        (RTC_MODE2_CTRL_PRESCALER_Msk &                                                                                \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_CTRL_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the RTC_MODE2_CTRL register */
#define RTC_MODE2_CTRL_PRESCALER_DIV1_Val _UINT16_(0x0) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/1  */
#define RTC_MODE2_CTRL_PRESCALER_DIV2_Val _UINT16_(0x1) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/2  */
#define RTC_MODE2_CTRL_PRESCALER_DIV4_Val _UINT16_(0x2) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/4  */
#define RTC_MODE2_CTRL_PRESCALER_DIV8_Val _UINT16_(0x3) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/8  */
#define RTC_MODE2_CTRL_PRESCALER_DIV16_Val _UINT16_(0x4) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/16  */
#define RTC_MODE2_CTRL_PRESCALER_DIV32_Val _UINT16_(0x5) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/32  */
#define RTC_MODE2_CTRL_PRESCALER_DIV64_Val _UINT16_(0x6) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/64  */
#define RTC_MODE2_CTRL_PRESCALER_DIV128_Val _UINT16_(0x7) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/128  */
#define RTC_MODE2_CTRL_PRESCALER_DIV256_Val _UINT16_(0x8) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/256  */
#define RTC_MODE2_CTRL_PRESCALER_DIV512_Val _UINT16_(0x9) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/512  */
#define RTC_MODE2_CTRL_PRESCALER_DIV1024_Val _UINT16_(0xA) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/1024  */
#define RTC_MODE2_CTRL_PRESCALER_DIV1                                                                                  \
        (RTC_MODE2_CTRL_PRESCALER_DIV1_Val                                                                             \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/1 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV2                                                                                  \
        (RTC_MODE2_CTRL_PRESCALER_DIV2_Val                                                                             \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/2 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV4                                                                                  \
        (RTC_MODE2_CTRL_PRESCALER_DIV4_Val                                                                             \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/4 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV8                                                                                  \
        (RTC_MODE2_CTRL_PRESCALER_DIV8_Val                                                                             \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/8 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV16                                                                                 \
        (RTC_MODE2_CTRL_PRESCALER_DIV16_Val                                                                            \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/16 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV32                                                                                 \
        (RTC_MODE2_CTRL_PRESCALER_DIV32_Val                                                                            \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/32 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV64                                                                                 \
        (RTC_MODE2_CTRL_PRESCALER_DIV64_Val                                                                            \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/64 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV128                                                                                \
        (RTC_MODE2_CTRL_PRESCALER_DIV128_Val                                                                           \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/128 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV256                                                                                \
        (RTC_MODE2_CTRL_PRESCALER_DIV256_Val                                                                           \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/256 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV512                                                                                \
        (RTC_MODE2_CTRL_PRESCALER_DIV512_Val                                                                           \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/512 Position  */
#define RTC_MODE2_CTRL_PRESCALER_DIV1024                                                                               \
        (RTC_MODE2_CTRL_PRESCALER_DIV1024_Val                                                                          \
         << RTC_MODE2_CTRL_PRESCALER_Pos) /* (RTC_MODE2_CTRL) CLK_RTC_CNT = GCLK_RTC/1024 Position  */
#define RTC_MODE2_CTRL_Msk _UINT16_(0x0FCF) /* (RTC_MODE2_CTRL) Register Mask  */


/* -------- RTC_READREQ : (RTC Offset: 0x02) (R/W 16) Read Request -------- */
#define RTC_READREQ_RESETVALUE _UINT16_(0x10) /*  (RTC_READREQ) Read Request  Reset Value */

#define RTC_READREQ_ADDR_Pos _UINT16_(0) /* (RTC_READREQ) Address Position */
#define RTC_READREQ_ADDR_Msk (_UINT16_(0x3F) << RTC_READREQ_ADDR_Pos) /* (RTC_READREQ) Address Mask */
#define RTC_READREQ_ADDR(value)                                                                                        \
        (RTC_READREQ_ADDR_Msk &                                                                                        \
         (_UINT16_(value) << RTC_READREQ_ADDR_Pos)) /* Assigment of value for ADDR in the RTC_READREQ register */
#define RTC_READREQ_RCONT_Pos _UINT16_(14) /* (RTC_READREQ) Read Continuously Position */
#define RTC_READREQ_RCONT_Msk (_UINT16_(0x1) << RTC_READREQ_RCONT_Pos) /* (RTC_READREQ) Read Continuously Mask */
#define RTC_READREQ_RCONT(value)                                                                                       \
        (RTC_READREQ_RCONT_Msk &                                                                                       \
         (_UINT16_(value) << RTC_READREQ_RCONT_Pos)) /* Assigment of value for RCONT in the RTC_READREQ register */
#define RTC_READREQ_RREQ_Pos _UINT16_(15) /* (RTC_READREQ) Read Request Position */
#define RTC_READREQ_RREQ_Msk (_UINT16_(0x1) << RTC_READREQ_RREQ_Pos) /* (RTC_READREQ) Read Request Mask */
#define RTC_READREQ_RREQ(value)                                                                                        \
        (RTC_READREQ_RREQ_Msk &                                                                                        \
         (_UINT16_(value) << RTC_READREQ_RREQ_Pos)) /* Assigment of value for RREQ in the RTC_READREQ register */
#define RTC_READREQ_Msk _UINT16_(0xC03F) /* (RTC_READREQ) Register Mask  */


