ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
#define RTC_MODE1_EVCTRL_PEREO_Pos _UINT16_(0) /* (RTC_MODE1_EVCTRL Position) Periodic Interval x Event Output Enable  \
                                                */
#define RTC_MODE1_EVCTRL_PEREO_Msk (_UINT16_(0xFF) << RTC_MODE1_EVCTRL_PEREO_Pos) /* (RTC_MODE1_EVCTRL Mask) PEREO */
#define RTC_MODE1_EVCTRL_PEREO(value) (RTC_MODE1_EVCTRL_PEREO_Msk & (_UINT16_(value) << RTC_MODE1_EVCTRL_PEREO_Pos))
#define RTC_MODE1_EVCTRL_CMPEO_Pos _UINT16_(8) /* (RTC_MODE1_EVCTRL Position) Compare x Event Output Enable */
#define RTC_MODE1_EVCTRL_CMPEO_Msk (_UINT16_(0x3) << RTC_MODE1_EVCTRL_CMPEO_Pos) /* (RTC_MODE1_EVCTRL Mask) CMPEO */
#define RTC_MODE1_EVCTRL_CMPEO(value) (RTC_MODE1_EVCTRL_CMPEO_Msk & (_UINT16_(value) << RTC_MODE1_EVCTRL_CMPEO_Pos))

/* -------- RTC_MODE2_EVCTRL : (RTC Offset: 0x04) (R/W 16) MODE2 Event Control -------- */
#define RTC_MODE2_EVCTRL_RESETVALUE _UINT16_(0x00) /*  (RTC_MODE2_EVCTRL) MODE2 Event Control  Reset Value */

#define RTC_MODE2_EVCTRL_PEREO0_Pos                                                                                    \
        _UINT16_(0) /* (RTC_MODE2_EVCTRL) Periodic Interval 0 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO0_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO0_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 0 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO0(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO0_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO0_Pos)) /* Assigment of value for PEREO0 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_PEREO1_Pos                                                                                    \
        _UINT16_(1) /* (RTC_MODE2_EVCTRL) Periodic Interval 1 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO1_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO1_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 1 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO1(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO1_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO1_Pos)) /* Assigment of value for PEREO1 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_PEREO2_Pos                                                                                    \
        _UINT16_(2) /* (RTC_MODE2_EVCTRL) Periodic Interval 2 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO2_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO2_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 2 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO2(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO2_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO2_Pos)) /* Assigment of value for PEREO2 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_PEREO3_Pos                                                                                    \
        _UINT16_(3) /* (RTC_MODE2_EVCTRL) Periodic Interval 3 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO3_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO3_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 3 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO3(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO3_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO3_Pos)) /* Assigment of value for PEREO3 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_PEREO4_Pos                                                                                    \
        _UINT16_(4) /* (RTC_MODE2_EVCTRL) Periodic Interval 4 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO4_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO4_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 4 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO4(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO4_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO4_Pos)) /* Assigment of value for PEREO4 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_PEREO5_Pos                                                                                    \
        _UINT16_(5) /* (RTC_MODE2_EVCTRL) Periodic Interval 5 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO5_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO5_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 5 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO5(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO5_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO5_Pos)) /* Assigment of value for PEREO5 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_PEREO6_Pos                                                                                    \
        _UINT16_(6) /* (RTC_MODE2_EVCTRL) Periodic Interval 6 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO6_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO6_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 6 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO6(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO6_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO6_Pos)) /* Assigment of value for PEREO6 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_PEREO7_Pos                                                                                    \
        _UINT16_(7) /* (RTC_MODE2_EVCTRL) Periodic Interval 7 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_PEREO7_Msk                                                                                    \
        (_UINT16_(0x1)                                                                                                 \
         << RTC_MODE2_EVCTRL_PEREO7_Pos) /* (RTC_MODE2_EVCTRL) Periodic Interval 7 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_PEREO7(value)                                                                                 \
        (RTC_MODE2_EVCTRL_PEREO7_Msk &                                                                                 \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_PEREO7_Pos)) /* Assigment of value for PEREO7 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_ALARMEO0_Pos _UINT16_(8) /* (RTC_MODE2_EVCTRL) Alarm 0 Event Output Enable Position */
#define RTC_MODE2_EVCTRL_ALARMEO0_Msk                                                                                  \
        (_UINT16_(0x1) << RTC_MODE2_EVCTRL_ALARMEO0_Pos) /* (RTC_MODE2_EVCTRL) Alarm 0 Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_ALARMEO0(value)                                                                               \
        (RTC_MODE2_EVCTRL_ALARMEO0_Msk &                                                                               \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_ALARMEO0_Pos)) /* Assigment of value for ALARMEO0 in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_OVFEO_Pos _UINT16_(15) /* (RTC_MODE2_EVCTRL) Overflow Event Output Enable Position */
#define RTC_MODE2_EVCTRL_OVFEO_Msk                                                                                     \
        (_UINT16_(0x1) << RTC_MODE2_EVCTRL_OVFEO_Pos) /* (RTC_MODE2_EVCTRL) Overflow Event Output Enable Mask */
#define RTC_MODE2_EVCTRL_OVFEO(value)                                                                                  \
        (RTC_MODE2_EVCTRL_OVFEO_Msk &                                                                                  \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE2_EVCTRL_OVFEO_Pos)) /* Assigment of value for OVFEO in the RTC_MODE2_EVCTRL register */
#define RTC_MODE2_EVCTRL_Msk _UINT16_(0x81FF) /* (RTC_MODE2_EVCTRL) Register Mask  */

#define RTC_MODE2_EVCTRL_PEREO_Pos _UINT16_(0) /* (RTC_MODE2_EVCTRL Position) Periodic Interval x Event Output Enable  \
                                                */
#define RTC_MODE2_EVCTRL_PEREO_Msk (_UINT16_(0xFF) << RTC_MODE2_EVCTRL_PEREO_Pos) /* (RTC_MODE2_EVCTRL Mask) PEREO */
#define RTC_MODE2_EVCTRL_PEREO(value) (RTC_MODE2_EVCTRL_PEREO_Msk & (_UINT16_(value) << RTC_MODE2_EVCTRL_PEREO_Pos))
#define RTC_MODE2_EVCTRL_ALARMEO_Pos _UINT16_(8) /* (RTC_MODE2_EVCTRL Position) Alarm x Event Output Enable */
#define RTC_MODE2_EVCTRL_ALARMEO_Msk                                                                                   \
        (_UINT16_(0x1) << RTC_MODE2_EVCTRL_ALARMEO_Pos) /* (RTC_MODE2_EVCTRL Mask) ALARMEO */
#define RTC_MODE2_EVCTRL_ALARMEO(value)                                                                                \
        (RTC_MODE2_EVCTRL_ALARMEO_Msk & (_UINT16_(value) << RTC_MODE2_EVCTRL_ALARMEO_Pos))

/* -------- RTC_MODE0_INTENCLR : (RTC Offset: 0x06) (R/W 8) MODE0 Interrupt Enable Clear -------- */
#define RTC_MODE0_INTENCLR_RESETVALUE                                                                                  \
        _UINT8_(0x00) /*  (RTC_MODE0_INTENCLR) MODE0 Interrupt Enable Clear  Reset Value */

#define RTC_MODE0_INTENCLR_CMP0_Pos _UINT8_(0) /* (RTC_MODE0_INTENCLR) Compare 0 Interrupt Enable Position */
#define RTC_MODE0_INTENCLR_CMP0_Msk                                                                                    \
        (_UINT8_(0x1) << RTC_MODE0_INTENCLR_CMP0_Pos) /* (RTC_MODE0_INTENCLR) Compare 0 Interrupt Enable Mask */
#define RTC_MODE0_INTENCLR_CMP0(value)                                                                                 \
        (RTC_MODE0_INTENCLR_CMP0_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTENCLR_CMP0_Pos)) /* Assigment of value for CMP0 in the RTC_MODE0_INTENCLR register */
#define RTC_MODE0_INTENCLR_SYNCRDY_Pos                                                                                 \
        _UINT8_(6) /* (RTC_MODE0_INTENCLR) Synchronization Ready Interrupt Enable Position */
#define RTC_MODE0_INTENCLR_SYNCRDY_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << RTC_MODE0_INTENCLR_SYNCRDY_Pos) /* (RTC_MODE0_INTENCLR) Synchronization Ready Interrupt Enable Mask */
#define RTC_MODE0_INTENCLR_SYNCRDY(value)                                                                              \
        (RTC_MODE0_INTENCLR_SYNCRDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTENCLR_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE0_INTENCLR register */
#define RTC_MODE0_INTENCLR_OVF_Pos _UINT8_(7) /* (RTC_MODE0_INTENCLR) Overflow Interrupt Enable Position */
#define RTC_MODE0_INTENCLR_OVF_Msk                                                                                     \
        (_UINT8_(0x1) << RTC_MODE0_INTENCLR_OVF_Pos) /* (RTC_MODE0_INTENCLR) Overflow Interrupt Enable Mask */
#define RTC_MODE0_INTENCLR_OVF(value)                                                                                  \
        (RTC_MODE0_INTENCLR_OVF_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTENCLR_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE0_INTENCLR register */
#define RTC_MODE0_INTENCLR_Msk _UINT8_(0xC1) /* (RTC_MODE0_INTENCLR) Register Mask  */

