ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
#define RTC_MODE0_INTENCLR_CMP_Pos _UINT8_(0) /* (RTC_MODE0_INTENCLR Position) Compare x Interrupt Enable */
#define RTC_MODE0_INTENCLR_CMP_Msk (_UINT8_(0x1) << RTC_MODE0_INTENCLR_CMP_Pos) /* (RTC_MODE0_INTENCLR Mask) CMP */
#define RTC_MODE0_INTENCLR_CMP(value) (RTC_MODE0_INTENCLR_CMP_Msk & (_UINT8_(value) << RTC_MODE0_INTENCLR_CMP_Pos))

/* -------- RTC_MODE1_INTENCLR : (RTC Offset: 0x06) (R/W 8) MODE1 Interrupt Enable Clear -------- */
#define RTC_MODE1_INTENCLR_RESETVALUE                                                                                  \
        _UINT8_(0x00) /*  (RTC_MODE1_INTENCLR) MODE1 Interrupt Enable Clear  Reset Value */

#define RTC_MODE1_INTENCLR_CMP0_Pos _UINT8_(0) /* (RTC_MODE1_INTENCLR) Compare 0 Interrupt Enable Position */
#define RTC_MODE1_INTENCLR_CMP0_Msk                                                                                    \
        (_UINT8_(0x1) << RTC_MODE1_INTENCLR_CMP0_Pos) /* (RTC_MODE1_INTENCLR) Compare 0 Interrupt Enable Mask */
#define RTC_MODE1_INTENCLR_CMP0(value)                                                                                 \
        (RTC_MODE1_INTENCLR_CMP0_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENCLR_CMP0_Pos)) /* Assigment of value for CMP0 in the RTC_MODE1_INTENCLR register */
#define RTC_MODE1_INTENCLR_CMP1_Pos _UINT8_(1) /* (RTC_MODE1_INTENCLR) Compare 1 Interrupt Enable Position */
#define RTC_MODE1_INTENCLR_CMP1_Msk                                                                                    \
        (_UINT8_(0x1) << RTC_MODE1_INTENCLR_CMP1_Pos) /* (RTC_MODE1_INTENCLR) Compare 1 Interrupt Enable Mask */
#define RTC_MODE1_INTENCLR_CMP1(value)                                                                                 \
        (RTC_MODE1_INTENCLR_CMP1_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENCLR_CMP1_Pos)) /* Assigment of value for CMP1 in the RTC_MODE1_INTENCLR register */
#define RTC_MODE1_INTENCLR_SYNCRDY_Pos                                                                                 \
        _UINT8_(6) /* (RTC_MODE1_INTENCLR) Synchronization Ready Interrupt Enable Position */
#define RTC_MODE1_INTENCLR_SYNCRDY_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << RTC_MODE1_INTENCLR_SYNCRDY_Pos) /* (RTC_MODE1_INTENCLR) Synchronization Ready Interrupt Enable Mask */
#define RTC_MODE1_INTENCLR_SYNCRDY(value)                                                                              \
        (RTC_MODE1_INTENCLR_SYNCRDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENCLR_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE1_INTENCLR register */
#define RTC_MODE1_INTENCLR_OVF_Pos _UINT8_(7) /* (RTC_MODE1_INTENCLR) Overflow Interrupt Enable Position */
#define RTC_MODE1_INTENCLR_OVF_Msk                                                                                     \
        (_UINT8_(0x1) << RTC_MODE1_INTENCLR_OVF_Pos) /* (RTC_MODE1_INTENCLR) Overflow Interrupt Enable Mask */
#define RTC_MODE1_INTENCLR_OVF(value)                                                                                  \
        (RTC_MODE1_INTENCLR_OVF_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENCLR_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE1_INTENCLR register */
#define RTC_MODE1_INTENCLR_Msk _UINT8_(0xC3) /* (RTC_MODE1_INTENCLR) Register Mask  */

#define RTC_MODE1_INTENCLR_CMP_Pos _UINT8_(0) /* (RTC_MODE1_INTENCLR Position) Compare x Interrupt Enable */
#define RTC_MODE1_INTENCLR_CMP_Msk (_UINT8_(0x3) << RTC_MODE1_INTENCLR_CMP_Pos) /* (RTC_MODE1_INTENCLR Mask) CMP */
#define RTC_MODE1_INTENCLR_CMP(value) (RTC_MODE1_INTENCLR_CMP_Msk & (_UINT8_(value) << RTC_MODE1_INTENCLR_CMP_Pos))

/* -------- RTC_MODE2_INTENCLR : (RTC Offset: 0x06) (R/W 8) MODE2 Interrupt Enable Clear -------- */
#define RTC_MODE2_INTENCLR_RESETVALUE                                                                                  \
        _UINT8_(0x00) /*  (RTC_MODE2_INTENCLR) MODE2 Interrupt Enable Clear  Reset Value */

#define RTC_MODE2_INTENCLR_ALARM0_Pos _UINT8_(0) /* (RTC_MODE2_INTENCLR) Alarm 0 Interrupt Enable Position */
#define RTC_MODE2_INTENCLR_ALARM0_Msk                                                                                  \
        (_UINT8_(0x1) << RTC_MODE2_INTENCLR_ALARM0_Pos) /* (RTC_MODE2_INTENCLR) Alarm 0 Interrupt Enable Mask */
#define RTC_MODE2_INTENCLR_ALARM0(value)                                                                               \
        (RTC_MODE2_INTENCLR_ALARM0_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTENCLR_ALARM0_Pos)) /* Assigment of value for ALARM0 in the RTC_MODE2_INTENCLR register */
#define RTC_MODE2_INTENCLR_SYNCRDY_Pos                                                                                 \
        _UINT8_(6) /* (RTC_MODE2_INTENCLR) Synchronization Ready Interrupt Enable Position */
#define RTC_MODE2_INTENCLR_SYNCRDY_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << RTC_MODE2_INTENCLR_SYNCRDY_Pos) /* (RTC_MODE2_INTENCLR) Synchronization Ready Interrupt Enable Mask */
#define RTC_MODE2_INTENCLR_SYNCRDY(value)                                                                              \
        (RTC_MODE2_INTENCLR_SYNCRDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTENCLR_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE2_INTENCLR register */
#define RTC_MODE2_INTENCLR_OVF_Pos _UINT8_(7) /* (RTC_MODE2_INTENCLR) Overflow Interrupt Enable Position */
#define RTC_MODE2_INTENCLR_OVF_Msk                                                                                     \
        (_UINT8_(0x1) << RTC_MODE2_INTENCLR_OVF_Pos) /* (RTC_MODE2_INTENCLR) Overflow Interrupt Enable Mask */
#define RTC_MODE2_INTENCLR_OVF(value)                                                                                  \
        (RTC_MODE2_INTENCLR_OVF_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTENCLR_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE2_INTENCLR register */
#define RTC_MODE2_INTENCLR_Msk _UINT8_(0xC1) /* (RTC_MODE2_INTENCLR) Register Mask  */

