ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
#define RTC_MODE2_INTENCLR_ALARM_Pos _UINT8_(0) /* (RTC_MODE2_INTENCLR Position) Alarm x Interrupt Enable */
#define RTC_MODE2_INTENCLR_ALARM_Msk                                                                                   \
        (_UINT8_(0x1) << RTC_MODE2_INTENCLR_ALARM_Pos) /* (RTC_MODE2_INTENCLR Mask) ALARM */
#define RTC_MODE2_INTENCLR_ALARM(value)                                                                                \
        (RTC_MODE2_INTENCLR_ALARM_Msk & (_UINT8_(value) << RTC_MODE2_INTENCLR_ALARM_Pos))

/* -------- RTC_MODE0_INTENSET : (RTC Offset: 0x07) (R/W 8) MODE0 Interrupt Enable Set -------- */
#define RTC_MODE0_INTENSET_RESETVALUE _UINT8_(0x00) /*  (RTC_MODE0_INTENSET) MODE0 Interrupt Enable Set  Reset Value   \
                                                     */

#define RTC_MODE0_INTENSET_CMP0_Pos _UINT8_(0) /* (RTC_MODE0_INTENSET) Compare 0 Interrupt Enable Position */
#define RTC_MODE0_INTENSET_CMP0_Msk                                                                                    \
        (_UINT8_(0x1) << RTC_MODE0_INTENSET_CMP0_Pos) /* (RTC_MODE0_INTENSET) Compare 0 Interrupt Enable Mask */
#define RTC_MODE0_INTENSET_CMP0(value)                                                                                 \
        (RTC_MODE0_INTENSET_CMP0_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTENSET_CMP0_Pos)) /* Assigment of value for CMP0 in the RTC_MODE0_INTENSET register */
#define RTC_MODE0_INTENSET_SYNCRDY_Pos                                                                                 \
        _UINT8_(6) /* (RTC_MODE0_INTENSET) Synchronization Ready Interrupt Enable Position */
#define RTC_MODE0_INTENSET_SYNCRDY_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << RTC_MODE0_INTENSET_SYNCRDY_Pos) /* (RTC_MODE0_INTENSET) Synchronization Ready Interrupt Enable Mask */
#define RTC_MODE0_INTENSET_SYNCRDY(value)                                                                              \
        (RTC_MODE0_INTENSET_SYNCRDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTENSET_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE0_INTENSET register */
#define RTC_MODE0_INTENSET_OVF_Pos _UINT8_(7) /* (RTC_MODE0_INTENSET) Overflow Interrupt Enable Position */
#define RTC_MODE0_INTENSET_OVF_Msk                                                                                     \
        (_UINT8_(0x1) << RTC_MODE0_INTENSET_OVF_Pos) /* (RTC_MODE0_INTENSET) Overflow Interrupt Enable Mask */
#define RTC_MODE0_INTENSET_OVF(value)                                                                                  \
        (RTC_MODE0_INTENSET_OVF_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTENSET_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE0_INTENSET register */
#define RTC_MODE0_INTENSET_Msk _UINT8_(0xC1) /* (RTC_MODE0_INTENSET) Register Mask  */

#define RTC_MODE0_INTENSET_CMP_Pos _UINT8_(0) /* (RTC_MODE0_INTENSET Position) Compare x Interrupt Enable */
#define RTC_MODE0_INTENSET_CMP_Msk (_UINT8_(0x1) << RTC_MODE0_INTENSET_CMP_Pos) /* (RTC_MODE0_INTENSET Mask) CMP */
#define RTC_MODE0_INTENSET_CMP(value) (RTC_MODE0_INTENSET_CMP_Msk & (_UINT8_(value) << RTC_MODE0_INTENSET_CMP_Pos))

/* -------- RTC_MODE1_INTENSET : (RTC Offset: 0x07) (R/W 8) MODE1 Interrupt Enable Set -------- */
#define RTC_MODE1_INTENSET_RESETVALUE _UINT8_(0x00) /*  (RTC_MODE1_INTENSET) MODE1 Interrupt Enable Set  Reset Value   \
                                                     */

#define RTC_MODE1_INTENSET_CMP0_Pos _UINT8_(0) /* (RTC_MODE1_INTENSET) Compare 0 Interrupt Enable Position */
#define RTC_MODE1_INTENSET_CMP0_Msk                                                                                    \
        (_UINT8_(0x1) << RTC_MODE1_INTENSET_CMP0_Pos) /* (RTC_MODE1_INTENSET) Compare 0 Interrupt Enable Mask */
#define RTC_MODE1_INTENSET_CMP0(value)                                                                                 \
        (RTC_MODE1_INTENSET_CMP0_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENSET_CMP0_Pos)) /* Assigment of value for CMP0 in the RTC_MODE1_INTENSET register */
#define RTC_MODE1_INTENSET_CMP1_Pos _UINT8_(1) /* (RTC_MODE1_INTENSET) Compare 1 Interrupt Enable Position */
#define RTC_MODE1_INTENSET_CMP1_Msk                                                                                    \
        (_UINT8_(0x1) << RTC_MODE1_INTENSET_CMP1_Pos) /* (RTC_MODE1_INTENSET) Compare 1 Interrupt Enable Mask */
#define RTC_MODE1_INTENSET_CMP1(value)                                                                                 \
        (RTC_MODE1_INTENSET_CMP1_Msk &                                                                                 \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENSET_CMP1_Pos)) /* Assigment of value for CMP1 in the RTC_MODE1_INTENSET register */
#define RTC_MODE1_INTENSET_SYNCRDY_Pos                                                                                 \
        _UINT8_(6) /* (RTC_MODE1_INTENSET) Synchronization Ready Interrupt Enable Position */
#define RTC_MODE1_INTENSET_SYNCRDY_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << RTC_MODE1_INTENSET_SYNCRDY_Pos) /* (RTC_MODE1_INTENSET) Synchronization Ready Interrupt Enable Mask */
#define RTC_MODE1_INTENSET_SYNCRDY(value)                                                                              \
        (RTC_MODE1_INTENSET_SYNCRDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENSET_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE1_INTENSET register */
#define RTC_MODE1_INTENSET_OVF_Pos _UINT8_(7) /* (RTC_MODE1_INTENSET) Overflow Interrupt Enable Position */
#define RTC_MODE1_INTENSET_OVF_Msk                                                                                     \
        (_UINT8_(0x1) << RTC_MODE1_INTENSET_OVF_Pos) /* (RTC_MODE1_INTENSET) Overflow Interrupt Enable Mask */
#define RTC_MODE1_INTENSET_OVF(value)                                                                                  \
        (RTC_MODE1_INTENSET_OVF_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTENSET_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE1_INTENSET register */
#define RTC_MODE1_INTENSET_Msk _UINT8_(0xC3) /* (RTC_MODE1_INTENSET) Register Mask  */

#define RTC_MODE1_INTENSET_CMP_Pos _UINT8_(0) /* (RTC_MODE1_INTENSET Position) Compare x Interrupt Enable */
#define RTC_MODE1_INTENSET_CMP_Msk (_UINT8_(0x3) << RTC_MODE1_INTENSET_CMP_Pos) /* (RTC_MODE1_INTENSET Mask) CMP */
#define RTC_MODE1_INTENSET_CMP(value) (RTC_MODE1_INTENSET_CMP_Msk & (_UINT8_(value) << RTC_MODE1_INTENSET_CMP_Pos))

/* -------- RTC_MODE2_INTENSET : (RTC Offset: 0x07) (R/W 8) MODE2 Interrupt Enable Set -------- */
#define RTC_MODE2_INTENSET_RESETVALUE _UINT8_(0x00) /*  (RTC_MODE2_INTENSET) MODE2 Interrupt Enable Set  Reset Value   \
                                                     */

#define RTC_MODE2_INTENSET_ALARM0_Pos _UINT8_(0) /* (RTC_MODE2_INTENSET) Alarm 0 Interrupt Enable Position */
#define RTC_MODE2_INTENSET_ALARM0_Msk                                                                                  \
        (_UINT8_(0x1) << RTC_MODE2_INTENSET_ALARM0_Pos) /* (RTC_MODE2_INTENSET) Alarm 0 Interrupt Enable Mask */
#define RTC_MODE2_INTENSET_ALARM0(value)                                                                               \
        (RTC_MODE2_INTENSET_ALARM0_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTENSET_ALARM0_Pos)) /* Assigment of value for ALARM0 in the RTC_MODE2_INTENSET register */
#define RTC_MODE2_INTENSET_SYNCRDY_Pos                                                                                 \
        _UINT8_(6) /* (RTC_MODE2_INTENSET) Synchronization Ready Interrupt Enable Position */
#define RTC_MODE2_INTENSET_SYNCRDY_Msk                                                                                 \
        (_UINT8_(0x1)                                                                                                  \
         << RTC_MODE2_INTENSET_SYNCRDY_Pos) /* (RTC_MODE2_INTENSET) Synchronization Ready Interrupt Enable Mask */
#define RTC_MODE2_INTENSET_SYNCRDY(value)                                                                              \
        (RTC_MODE2_INTENSET_SYNCRDY_Msk &                                                                              \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTENSET_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE2_INTENSET register */
#define RTC_MODE2_INTENSET_OVF_Pos _UINT8_(7) /* (RTC_MODE2_INTENSET) Overflow Interrupt Enable Position */
#define RTC_MODE2_INTENSET_OVF_Msk                                                                                     \
        (_UINT8_(0x1) << RTC_MODE2_INTENSET_OVF_Pos) /* (RTC_MODE2_INTENSET) Overflow Interrupt Enable Mask */
#define RTC_MODE2_INTENSET_OVF(value)                                                                                  \
        (RTC_MODE2_INTENSET_OVF_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTENSET_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE2_INTENSET register */
#define RTC_MODE2_INTENSET_Msk _UINT8_(0xC1) /* (RTC_MODE2_INTENSET) Register Mask  */

#define RTC_MODE2_INTENSET_ALARM_Pos _UINT8_(0) /* (RTC_MODE2_INTENSET Position) Alarm x Interrupt Enable */
#define RTC_MODE2_INTENSET_ALARM_Msk                                                                                   \
        (_UINT8_(0x1) << RTC_MODE2_INTENSET_ALARM_Pos) /* (RTC_MODE2_INTENSET Mask) ALARM */
#define RTC_MODE2_INTENSET_ALARM(value)                                                                                \
        (RTC_MODE2_INTENSET_ALARM_Msk & (_UINT8_(value) << RTC_MODE2_INTENSET_ALARM_Pos))

