ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
/* -------- RTC_MODE0_INTFLAG : (RTC Offset: 0x08) (R/W 8) MODE0 Interrupt Flag Status and Clear -------- */
#define RTC_MODE0_INTFLAG_RESETVALUE                                                                                   \
        _UINT8_(0x00) /*  (RTC_MODE0_INTFLAG) MODE0 Interrupt Flag Status and Clear  Reset Value */

#define RTC_MODE0_INTFLAG_CMP0_Pos _UINT8_(0) /* (RTC_MODE0_INTFLAG) Compare 0 Position */
#define RTC_MODE0_INTFLAG_CMP0_Msk (_UINT8_(0x1) << RTC_MODE0_INTFLAG_CMP0_Pos) /* (RTC_MODE0_INTFLAG) Compare 0 Mask  \
                                                                                 */
#define RTC_MODE0_INTFLAG_CMP0(value)                                                                                  \
        (RTC_MODE0_INTFLAG_CMP0_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTFLAG_CMP0_Pos)) /* Assigment of value for CMP0 in the RTC_MODE0_INTFLAG register */
#define RTC_MODE0_INTFLAG_SYNCRDY_Pos _UINT8_(6) /* (RTC_MODE0_INTFLAG) Synchronization Ready Position */
#define RTC_MODE0_INTFLAG_SYNCRDY_Msk                                                                                  \
        (_UINT8_(0x1) << RTC_MODE0_INTFLAG_SYNCRDY_Pos) /* (RTC_MODE0_INTFLAG) Synchronization Ready Mask */
#define RTC_MODE0_INTFLAG_SYNCRDY(value)                                                                               \
        (RTC_MODE0_INTFLAG_SYNCRDY_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTFLAG_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE0_INTFLAG register */
#define RTC_MODE0_INTFLAG_OVF_Pos _UINT8_(7) /* (RTC_MODE0_INTFLAG) Overflow Position */
#define RTC_MODE0_INTFLAG_OVF_Msk (_UINT8_(0x1) << RTC_MODE0_INTFLAG_OVF_Pos) /* (RTC_MODE0_INTFLAG) Overflow Mask */
#define RTC_MODE0_INTFLAG_OVF(value)                                                                                   \
        (RTC_MODE0_INTFLAG_OVF_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE0_INTFLAG_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE0_INTFLAG register */
#define RTC_MODE0_INTFLAG_Msk _UINT8_(0xC1) /* (RTC_MODE0_INTFLAG) Register Mask  */

#define RTC_MODE0_INTFLAG_CMP_Pos _UINT8_(0) /* (RTC_MODE0_INTFLAG Position) Compare x */
#define RTC_MODE0_INTFLAG_CMP_Msk (_UINT8_(0x1) << RTC_MODE0_INTFLAG_CMP_Pos) /* (RTC_MODE0_INTFLAG Mask) CMP */
#define RTC_MODE0_INTFLAG_CMP(value) (RTC_MODE0_INTFLAG_CMP_Msk & (_UINT8_(value) << RTC_MODE0_INTFLAG_CMP_Pos))

/* -------- RTC_MODE1_INTFLAG : (RTC Offset: 0x08) (R/W 8) MODE1 Interrupt Flag Status and Clear -------- */
#define RTC_MODE1_INTFLAG_RESETVALUE                                                                                   \
        _UINT8_(0x00) /*  (RTC_MODE1_INTFLAG) MODE1 Interrupt Flag Status and Clear  Reset Value */

#define RTC_MODE1_INTFLAG_CMP0_Pos _UINT8_(0) /* (RTC_MODE1_INTFLAG) Compare 0 Position */
#define RTC_MODE1_INTFLAG_CMP0_Msk (_UINT8_(0x1) << RTC_MODE1_INTFLAG_CMP0_Pos) /* (RTC_MODE1_INTFLAG) Compare 0 Mask  \
                                                                                 */
#define RTC_MODE1_INTFLAG_CMP0(value)                                                                                  \
        (RTC_MODE1_INTFLAG_CMP0_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTFLAG_CMP0_Pos)) /* Assigment of value for CMP0 in the RTC_MODE1_INTFLAG register */
#define RTC_MODE1_INTFLAG_CMP1_Pos _UINT8_(1) /* (RTC_MODE1_INTFLAG) Compare 1 Position */
#define RTC_MODE1_INTFLAG_CMP1_Msk (_UINT8_(0x1) << RTC_MODE1_INTFLAG_CMP1_Pos) /* (RTC_MODE1_INTFLAG) Compare 1 Mask  \
                                                                                 */
#define RTC_MODE1_INTFLAG_CMP1(value)                                                                                  \
        (RTC_MODE1_INTFLAG_CMP1_Msk &                                                                                  \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTFLAG_CMP1_Pos)) /* Assigment of value for CMP1 in the RTC_MODE1_INTFLAG register */
#define RTC_MODE1_INTFLAG_SYNCRDY_Pos _UINT8_(6) /* (RTC_MODE1_INTFLAG) Synchronization Ready Position */
#define RTC_MODE1_INTFLAG_SYNCRDY_Msk                                                                                  \
        (_UINT8_(0x1) << RTC_MODE1_INTFLAG_SYNCRDY_Pos) /* (RTC_MODE1_INTFLAG) Synchronization Ready Mask */
#define RTC_MODE1_INTFLAG_SYNCRDY(value)                                                                               \
        (RTC_MODE1_INTFLAG_SYNCRDY_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTFLAG_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE1_INTFLAG register */
#define RTC_MODE1_INTFLAG_OVF_Pos _UINT8_(7) /* (RTC_MODE1_INTFLAG) Overflow Position */
#define RTC_MODE1_INTFLAG_OVF_Msk (_UINT8_(0x1) << RTC_MODE1_INTFLAG_OVF_Pos) /* (RTC_MODE1_INTFLAG) Overflow Mask */
#define RTC_MODE1_INTFLAG_OVF(value)                                                                                   \
        (RTC_MODE1_INTFLAG_OVF_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE1_INTFLAG_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE1_INTFLAG register */
#define RTC_MODE1_INTFLAG_Msk _UINT8_(0xC3) /* (RTC_MODE1_INTFLAG) Register Mask  */

#define RTC_MODE1_INTFLAG_CMP_Pos _UINT8_(0) /* (RTC_MODE1_INTFLAG Position) Compare x */
#define RTC_MODE1_INTFLAG_CMP_Msk (_UINT8_(0x3) << RTC_MODE1_INTFLAG_CMP_Pos) /* (RTC_MODE1_INTFLAG Mask) CMP */
#define RTC_MODE1_INTFLAG_CMP(value) (RTC_MODE1_INTFLAG_CMP_Msk & (_UINT8_(value) << RTC_MODE1_INTFLAG_CMP_Pos))

/* -------- RTC_MODE2_INTFLAG : (RTC Offset: 0x08) (R/W 8) MODE2 Interrupt Flag Status and Clear -------- */
#define RTC_MODE2_INTFLAG_RESETVALUE                                                                                   \
        _UINT8_(0x00) /*  (RTC_MODE2_INTFLAG) MODE2 Interrupt Flag Status and Clear  Reset Value */

#define RTC_MODE2_INTFLAG_ALARM0_Pos _UINT8_(0) /* (RTC_MODE2_INTFLAG) Alarm 0 Position */
#define RTC_MODE2_INTFLAG_ALARM0_Msk                                                                                   \
        (_UINT8_(0x1) << RTC_MODE2_INTFLAG_ALARM0_Pos) /* (RTC_MODE2_INTFLAG) Alarm 0 Mask */
#define RTC_MODE2_INTFLAG_ALARM0(value)                                                                                \
        (RTC_MODE2_INTFLAG_ALARM0_Msk &                                                                                \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTFLAG_ALARM0_Pos)) /* Assigment of value for ALARM0 in the RTC_MODE2_INTFLAG register */
#define RTC_MODE2_INTFLAG_SYNCRDY_Pos _UINT8_(6) /* (RTC_MODE2_INTFLAG) Synchronization Ready Position */
#define RTC_MODE2_INTFLAG_SYNCRDY_Msk                                                                                  \
        (_UINT8_(0x1) << RTC_MODE2_INTFLAG_SYNCRDY_Pos) /* (RTC_MODE2_INTFLAG) Synchronization Ready Mask */
#define RTC_MODE2_INTFLAG_SYNCRDY(value)                                                                               \
        (RTC_MODE2_INTFLAG_SYNCRDY_Msk &                                                                               \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTFLAG_SYNCRDY_Pos)) /* Assigment of value for SYNCRDY in the RTC_MODE2_INTFLAG register */
#define RTC_MODE2_INTFLAG_OVF_Pos _UINT8_(7) /* (RTC_MODE2_INTFLAG) Overflow Position */
#define RTC_MODE2_INTFLAG_OVF_Msk (_UINT8_(0x1) << RTC_MODE2_INTFLAG_OVF_Pos) /* (RTC_MODE2_INTFLAG) Overflow Mask */
#define RTC_MODE2_INTFLAG_OVF(value)                                                                                   \
        (RTC_MODE2_INTFLAG_OVF_Msk &                                                                                   \
         (_UINT8_(value)                                                                                               \
          << RTC_MODE2_INTFLAG_OVF_Pos)) /* Assigment of value for OVF in the RTC_MODE2_INTFLAG register */
#define RTC_MODE2_INTFLAG_Msk _UINT8_(0xC1) /* (RTC_MODE2_INTFLAG) Register Mask  */

#define RTC_MODE2_INTFLAG_ALARM_Pos _UINT8_(0) /* (RTC_MODE2_INTFLAG Position) Alarm x */
#define RTC_MODE2_INTFLAG_ALARM_Msk (_UINT8_(0x1) << RTC_MODE2_INTFLAG_ALARM_Pos) /* (RTC_MODE2_INTFLAG Mask) ALARM */
#define RTC_MODE2_INTFLAG_ALARM(value) (RTC_MODE2_INTFLAG_ALARM_Msk & (_UINT8_(value) << RTC_MODE2_INTFLAG_ALARM_Pos))

/* -------- RTC_STATUS : (RTC Offset: 0x0A) (R/W 8) Status -------- */
#define RTC_STATUS_RESETVALUE _UINT8_(0x00) /*  (RTC_STATUS) Status  Reset Value */

#define RTC_STATUS_SYNCBUSY_Pos _UINT8_(7) /* (RTC_STATUS) Synchronization Busy Position */
#define RTC_STATUS_SYNCBUSY_Msk (_UINT8_(0x1) << RTC_STATUS_SYNCBUSY_Pos) /* (RTC_STATUS) Synchronization Busy Mask */
#define RTC_STATUS_SYNCBUSY(value)                                                                                     \
        (RTC_STATUS_SYNCBUSY_Msk &                                                                                     \
         (_UINT8_(value) << RTC_STATUS_SYNCBUSY_Pos)) /* Assigment of value for SYNCBUSY in the RTC_STATUS register */
#define RTC_STATUS_Msk _UINT8_(0x80) /* (RTC_STATUS) Register Mask  */


/* -------- RTC_DBGCTRL : (RTC Offset: 0x0B) (R/W 8) Debug Control -------- */
#define RTC_DBGCTRL_RESETVALUE _UINT8_(0x00) /*  (RTC_DBGCTRL) Debug Control  Reset Value */

#define RTC_DBGCTRL_DBGRUN_Pos _UINT8_(0) /* (RTC_DBGCTRL) Run During Debug Position */
#define RTC_DBGCTRL_DBGRUN_Msk (_UINT8_(0x1) << RTC_DBGCTRL_DBGRUN_Pos) /* (RTC_DBGCTRL) Run During Debug Mask */
#define RTC_DBGCTRL_DBGRUN(value)                                                                                      \
        (RTC_DBGCTRL_DBGRUN_Msk &                                                                                      \
         (_UINT8_(value) << RTC_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the RTC_DBGCTRL register */
#define RTC_DBGCTRL_Msk _UINT8_(0x01) /* (RTC_DBGCTRL) Register Mask  */


/* -------- RTC_FREQCORR : (RTC Offset: 0x0C) (R/W 8) Frequency Correction -------- */
#define RTC_FREQCORR_RESETVALUE _UINT8_(0x00) /*  (RTC_FREQCORR) Frequency Correction  Reset Value */

