ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
#define RTC_FREQCORR_VALUE_Pos _UINT8_(0) /* (RTC_FREQCORR) Correction Value Position */
#define RTC_FREQCORR_VALUE_Msk (_UINT8_(0x7F) << RTC_FREQCORR_VALUE_Pos) /* (RTC_FREQCORR) Correction Value Mask */
#define RTC_FREQCORR_VALUE(value)                                                                                      \
        (RTC_FREQCORR_VALUE_Msk &                                                                                      \
         (_UINT8_(value) << RTC_FREQCORR_VALUE_Pos)) /* Assigment of value for VALUE in the RTC_FREQCORR register */
#define RTC_FREQCORR_SIGN_Pos _UINT8_(7) /* (RTC_FREQCORR) Correction Sign Position */
#define RTC_FREQCORR_SIGN_Msk (_UINT8_(0x1) << RTC_FREQCORR_SIGN_Pos) /* (RTC_FREQCORR) Correction Sign Mask */
#define RTC_FREQCORR_SIGN(value)                                                                                       \
        (RTC_FREQCORR_SIGN_Msk &                                                                                       \
         (_UINT8_(value) << RTC_FREQCORR_SIGN_Pos)) /* Assigment of value for SIGN in the RTC_FREQCORR register */
#define RTC_FREQCORR_Msk _UINT8_(0xFF) /* (RTC_FREQCORR) Register Mask  */


/* -------- RTC_MODE0_COUNT : (RTC Offset: 0x10) (R/W 32) MODE0 Counter Value -------- */
#define RTC_MODE0_COUNT_RESETVALUE _UINT32_(0x00) /*  (RTC_MODE0_COUNT) MODE0 Counter Value  Reset Value */

#define RTC_MODE0_COUNT_COUNT_Pos _UINT32_(0) /* (RTC_MODE0_COUNT) Counter Value Position */
#define RTC_MODE0_COUNT_COUNT_Msk                                                                                      \
        (_UINT32_(0xFFFFFFFF) << RTC_MODE0_COUNT_COUNT_Pos) /* (RTC_MODE0_COUNT) Counter Value Mask */
#define RTC_MODE0_COUNT_COUNT(value)                                                                                   \
        (RTC_MODE0_COUNT_COUNT_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE0_COUNT_COUNT_Pos)) /* Assigment of value for COUNT in the RTC_MODE0_COUNT register */
#define RTC_MODE0_COUNT_Msk _UINT32_(0xFFFFFFFF) /* (RTC_MODE0_COUNT) Register Mask  */


/* -------- RTC_MODE1_COUNT : (RTC Offset: 0x10) (R/W 16) MODE1 Counter Value -------- */
#define RTC_MODE1_COUNT_RESETVALUE _UINT16_(0x00) /*  (RTC_MODE1_COUNT) MODE1 Counter Value  Reset Value */

#define RTC_MODE1_COUNT_COUNT_Pos _UINT16_(0) /* (RTC_MODE1_COUNT) Counter Value Position */
#define RTC_MODE1_COUNT_COUNT_Msk                                                                                      \
        (_UINT16_(0xFFFF) << RTC_MODE1_COUNT_COUNT_Pos) /* (RTC_MODE1_COUNT) Counter Value Mask */
#define RTC_MODE1_COUNT_COUNT(value)                                                                                   \
        (RTC_MODE1_COUNT_COUNT_Msk &                                                                                   \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE1_COUNT_COUNT_Pos)) /* Assigment of value for COUNT in the RTC_MODE1_COUNT register */
#define RTC_MODE1_COUNT_Msk _UINT16_(0xFFFF) /* (RTC_MODE1_COUNT) Register Mask  */


/* -------- RTC_MODE2_CLOCK : (RTC Offset: 0x10) (R/W 32) MODE2 Clock Value -------- */
#define RTC_MODE2_CLOCK_RESETVALUE _UINT32_(0x00) /*  (RTC_MODE2_CLOCK) MODE2 Clock Value  Reset Value */

#define RTC_MODE2_CLOCK_SECOND_Pos _UINT32_(0) /* (RTC_MODE2_CLOCK) Second Position */
#define RTC_MODE2_CLOCK_SECOND_Msk (_UINT32_(0x3F) << RTC_MODE2_CLOCK_SECOND_Pos) /* (RTC_MODE2_CLOCK) Second Mask */
#define RTC_MODE2_CLOCK_SECOND(value)                                                                                  \
        (RTC_MODE2_CLOCK_SECOND_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_CLOCK_SECOND_Pos)) /* Assigment of value for SECOND in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_MINUTE_Pos _UINT32_(6) /* (RTC_MODE2_CLOCK) Minute Position */
#define RTC_MODE2_CLOCK_MINUTE_Msk (_UINT32_(0x3F) << RTC_MODE2_CLOCK_MINUTE_Pos) /* (RTC_MODE2_CLOCK) Minute Mask */
#define RTC_MODE2_CLOCK_MINUTE(value)                                                                                  \
        (RTC_MODE2_CLOCK_MINUTE_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_CLOCK_MINUTE_Pos)) /* Assigment of value for MINUTE in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_HOUR_Pos _UINT32_(12) /* (RTC_MODE2_CLOCK) Hour Position */
#define RTC_MODE2_CLOCK_HOUR_Msk (_UINT32_(0x1F) << RTC_MODE2_CLOCK_HOUR_Pos) /* (RTC_MODE2_CLOCK) Hour Mask */
#define RTC_MODE2_CLOCK_HOUR(value)                                                                                    \
        (RTC_MODE2_CLOCK_HOUR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_CLOCK_HOUR_Pos)) /* Assigment of value for HOUR in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_HOUR_AM_Val _UINT32_(0x0) /* (RTC_MODE2_CLOCK) AM when CLKREP in 12-hour  */
#define RTC_MODE2_CLOCK_HOUR_PM_Val _UINT32_(0x10) /* (RTC_MODE2_CLOCK) PM when CLKREP in 12-hour  */
#define RTC_MODE2_CLOCK_HOUR_AM                                                                                        \
        (                                                                                                              \
                RTC_MODE2_CLOCK_HOUR_AM_Val                                                                            \
                << RTC_MODE2_CLOCK_HOUR_Pos) /* (RTC_MODE2_CLOCK) AM when CLKREP in 12-hour Position  */
#define RTC_MODE2_CLOCK_HOUR_PM                                                                                        \
        (                                                                                                              \
                RTC_MODE2_CLOCK_HOUR_PM_Val                                                                            \
                << RTC_MODE2_CLOCK_HOUR_Pos) /* (RTC_MODE2_CLOCK) PM when CLKREP in 12-hour Position  */
#define RTC_MODE2_CLOCK_DAY_Pos _UINT32_(17) /* (RTC_MODE2_CLOCK) Day Position */
#define RTC_MODE2_CLOCK_DAY_Msk (_UINT32_(0x1F) << RTC_MODE2_CLOCK_DAY_Pos) /* (RTC_MODE2_CLOCK) Day Mask */
#define RTC_MODE2_CLOCK_DAY(value)                                                                                     \
        (RTC_MODE2_CLOCK_DAY_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_CLOCK_DAY_Pos)) /* Assigment of value for DAY in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_MONTH_Pos _UINT32_(22) /* (RTC_MODE2_CLOCK) Month Position */
#define RTC_MODE2_CLOCK_MONTH_Msk (_UINT32_(0xF) << RTC_MODE2_CLOCK_MONTH_Pos) /* (RTC_MODE2_CLOCK) Month Mask */
#define RTC_MODE2_CLOCK_MONTH(value)                                                                                   \
        (RTC_MODE2_CLOCK_MONTH_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_CLOCK_MONTH_Pos)) /* Assigment of value for MONTH in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_YEAR_Pos _UINT32_(26) /* (RTC_MODE2_CLOCK) Year Position */
#define RTC_MODE2_CLOCK_YEAR_Msk (_UINT32_(0x3F) << RTC_MODE2_CLOCK_YEAR_Pos) /* (RTC_MODE2_CLOCK) Year Mask */
#define RTC_MODE2_CLOCK_YEAR(value)                                                                                    \
        (RTC_MODE2_CLOCK_YEAR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_CLOCK_YEAR_Pos)) /* Assigment of value for YEAR in the RTC_MODE2_CLOCK register */
#define RTC_MODE2_CLOCK_Msk _UINT32_(0xFFFFFFFF) /* (RTC_MODE2_CLOCK) Register Mask  */


/* -------- RTC_MODE1_PER : (RTC Offset: 0x14) (R/W 16) MODE1 Counter Period -------- */
#define RTC_MODE1_PER_RESETVALUE _UINT16_(0x00) /*  (RTC_MODE1_PER) MODE1 Counter Period  Reset Value */

#define RTC_MODE1_PER_PER_Pos _UINT16_(0) /* (RTC_MODE1_PER) Counter Period Position */
#define RTC_MODE1_PER_PER_Msk (_UINT16_(0xFFFF) << RTC_MODE1_PER_PER_Pos) /* (RTC_MODE1_PER) Counter Period Mask */
#define RTC_MODE1_PER_PER(value)                                                                                       \
        (RTC_MODE1_PER_PER_Msk &                                                                                       \
         (_UINT16_(value) << RTC_MODE1_PER_PER_Pos)) /* Assigment of value for PER in the RTC_MODE1_PER register */
#define RTC_MODE1_PER_Msk _UINT16_(0xFFFF) /* (RTC_MODE1_PER) Register Mask  */


/* -------- RTC_MODE0_COMP : (RTC Offset: 0x18) (R/W 32) MODE0 Compare n Value -------- */
#define RTC_MODE0_COMP_RESETVALUE _UINT32_(0x00) /*  (RTC_MODE0_COMP) MODE0 Compare n Value  Reset Value */

#define RTC_MODE0_COMP_COMP_Pos _UINT32_(0) /* (RTC_MODE0_COMP) Compare Value Position */
#define RTC_MODE0_COMP_COMP_Msk                                                                                        \
        (_UINT32_(0xFFFFFFFF) << RTC_MODE0_COMP_COMP_Pos) /* (RTC_MODE0_COMP) Compare Value Mask */
#define RTC_MODE0_COMP_COMP(value)                                                                                     \
        (RTC_MODE0_COMP_COMP_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE0_COMP_COMP_Pos)) /* Assigment of value for COMP in the RTC_MODE0_COMP register */
#define RTC_MODE0_COMP_Msk _UINT32_(0xFFFFFFFF) /* (RTC_MODE0_COMP) Register Mask  */


/* -------- RTC_MODE1_COMP : (RTC Offset: 0x18) (R/W 16) MODE1 Compare n Value -------- */
#define RTC_MODE1_COMP_RESETVALUE _UINT16_(0x00) /*  (RTC_MODE1_COMP) MODE1 Compare n Value  Reset Value */

#define RTC_MODE1_COMP_COMP_Pos _UINT16_(0) /* (RTC_MODE1_COMP) Compare Value Position */
#define RTC_MODE1_COMP_COMP_Msk (_UINT16_(0xFFFF) << RTC_MODE1_COMP_COMP_Pos) /* (RTC_MODE1_COMP) Compare Value Mask   \
                                                                               */
#define RTC_MODE1_COMP_COMP(value)                                                                                     \
        (RTC_MODE1_COMP_COMP_Msk &                                                                                     \
         (_UINT16_(value)                                                                                              \
          << RTC_MODE1_COMP_COMP_Pos)) /* Assigment of value for COMP in the RTC_MODE1_COMP register */
#define RTC_MODE1_COMP_Msk _UINT16_(0xFFFF) /* (RTC_MODE1_COMP) Register Mask  */


/* -------- RTC_MODE2_ALARM : (RTC Offset: 0x18) (R/W 32) MODE2_ALARM Alarm n Value -------- */
#define RTC_MODE2_ALARM_RESETVALUE _UINT32_(0x00) /*  (RTC_MODE2_ALARM) MODE2_ALARM Alarm n Value  Reset Value */

#define RTC_MODE2_ALARM_SECOND_Pos _UINT32_(0) /* (RTC_MODE2_ALARM) Second Position */
#define RTC_MODE2_ALARM_SECOND_Msk (_UINT32_(0x3F) << RTC_MODE2_ALARM_SECOND_Pos) /* (RTC_MODE2_ALARM) Second Mask */
#define RTC_MODE2_ALARM_SECOND(value)                                                                                  \
        (RTC_MODE2_ALARM_SECOND_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_ALARM_SECOND_Pos)) /* Assigment of value for SECOND in the RTC_MODE2_ALARM register */
#define RTC_MODE2_ALARM_MINUTE_Pos _UINT32_(6) /* (RTC_MODE2_ALARM) Minute Position */
#define RTC_MODE2_ALARM_MINUTE_Msk (_UINT32_(0x3F) << RTC_MODE2_ALARM_MINUTE_Pos) /* (RTC_MODE2_ALARM) Minute Mask */
#define RTC_MODE2_ALARM_MINUTE(value)                                                                                  \
        (RTC_MODE2_ALARM_MINUTE_Msk &                                                                                  \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_ALARM_MINUTE_Pos)) /* Assigment of value for MINUTE in the RTC_MODE2_ALARM register */
#define RTC_MODE2_ALARM_HOUR_Pos _UINT32_(12) /* (RTC_MODE2_ALARM) Hour Position */
#define RTC_MODE2_ALARM_HOUR_Msk (_UINT32_(0x1F) << RTC_MODE2_ALARM_HOUR_Pos) /* (RTC_MODE2_ALARM) Hour Mask */
#define RTC_MODE2_ALARM_HOUR(value)                                                                                    \
        (RTC_MODE2_ALARM_HOUR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_ALARM_HOUR_Pos)) /* Assigment of value for HOUR in the RTC_MODE2_ALARM register */
#define RTC_MODE2_ALARM_HOUR_AM_Val _UINT32_(0x0) /* (RTC_MODE2_ALARM) Morning hour  */
#define RTC_MODE2_ALARM_HOUR_PM_Val _UINT32_(0x10) /* (RTC_MODE2_ALARM) Afternoon hour  */
#define RTC_MODE2_ALARM_HOUR_AM                                                                                        \
        (RTC_MODE2_ALARM_HOUR_AM_Val << RTC_MODE2_ALARM_HOUR_Pos) /* (RTC_MODE2_ALARM) Morning hour Position  */
#define RTC_MODE2_ALARM_HOUR_PM                                                                                        \
        (RTC_MODE2_ALARM_HOUR_PM_Val << RTC_MODE2_ALARM_HOUR_Pos) /* (RTC_MODE2_ALARM) Afternoon hour Position  */
#define RTC_MODE2_ALARM_DAY_Pos _UINT32_(17) /* (RTC_MODE2_ALARM) Day Position */
#define RTC_MODE2_ALARM_DAY_Msk (_UINT32_(0x1F) << RTC_MODE2_ALARM_DAY_Pos) /* (RTC_MODE2_ALARM) Day Mask */
#define RTC_MODE2_ALARM_DAY(value)                                                                                     \
        (RTC_MODE2_ALARM_DAY_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_ALARM_DAY_Pos)) /* Assigment of value for DAY in the RTC_MODE2_ALARM register */
#define RTC_MODE2_ALARM_MONTH_Pos _UINT32_(22) /* (RTC_MODE2_ALARM) Month Position */
#define RTC_MODE2_ALARM_MONTH_Msk (_UINT32_(0xF) << RTC_MODE2_ALARM_MONTH_Pos) /* (RTC_MODE2_ALARM) Month Mask */
#define RTC_MODE2_ALARM_MONTH(value)                                                                                   \
        (RTC_MODE2_ALARM_MONTH_Msk &                                                                                   \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_ALARM_MONTH_Pos)) /* Assigment of value for MONTH in the RTC_MODE2_ALARM register */
#define RTC_MODE2_ALARM_YEAR_Pos _UINT32_(26) /* (RTC_MODE2_ALARM) Year Position */
#define RTC_MODE2_ALARM_YEAR_Msk (_UINT32_(0x3F) << RTC_MODE2_ALARM_YEAR_Pos) /* (RTC_MODE2_ALARM) Year Mask */
#define RTC_MODE2_ALARM_YEAR(value)                                                                                    \
        (RTC_MODE2_ALARM_YEAR_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << RTC_MODE2_ALARM_YEAR_Pos)) /* Assigment of value for YEAR in the RTC_MODE2_ALARM register */
#define RTC_MODE2_ALARM_Msk _UINT32_(0xFFFFFFFF) /* (RTC_MODE2_ALARM) Register Mask  */


/* -------- RTC_MODE2_MASK : (RTC Offset: 0x1C) (R/W 8) MODE2_ALARM Alarm n Mask -------- */
#define RTC_MODE2_MASK_RESETVALUE _UINT8_(0x00) /*  (RTC_MODE2_MASK) MODE2_ALARM Alarm n Mask  Reset Value */

#define RTC_MODE2_MASK_SEL_Pos _UINT8_(0) /* (RTC_MODE2_MASK) Alarm Mask Selection Position */
#define RTC_MODE2_MASK_SEL_Msk (_UINT8_(0x7) << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Alarm Mask Selection Mask  \
                                                                         */
#define RTC_MODE2_MASK_SEL(value)                                                                                      \
        (RTC_MODE2_MASK_SEL_Msk &                                                                                      \
         (_UINT8_(value) << RTC_MODE2_MASK_SEL_Pos)) /* Assigment of value for SEL in the RTC_MODE2_MASK register */
#define RTC_MODE2_MASK_SEL_OFF_Val _UINT8_(0x0) /* (RTC_MODE2_MASK) Alarm Disabled  */
#define RTC_MODE2_MASK_SEL_SS_Val _UINT8_(0x1) /* (RTC_MODE2_MASK) Match seconds only  */
#define RTC_MODE2_MASK_SEL_MMSS_Val _UINT8_(0x2) /* (RTC_MODE2_MASK) Match seconds and minutes only  */
#define RTC_MODE2_MASK_SEL_HHMMSS_Val _UINT8_(0x3) /* (RTC_MODE2_MASK) Match seconds, minutes, and hours only  */
#define RTC_MODE2_MASK_SEL_DDHHMMSS_Val                                                                                \
        _UINT8_(0x4) /* (RTC_MODE2_MASK) Match seconds, minutes, hours, and days only  */
#define RTC_MODE2_MASK_SEL_MMDDHHMMSS_Val                                                                              \
        _UINT8_(0x5) /* (RTC_MODE2_MASK) Match seconds, minutes, hours, days, and months only  */
#define RTC_MODE2_MASK_SEL_YYMMDDHHMMSS_Val                                                                            \
        _UINT8_(0x6) /* (RTC_MODE2_MASK) Match seconds, minutes, hours, days, months, and years  */
#define RTC_MODE2_MASK_SEL_OFF                                                                                         \
        (RTC_MODE2_MASK_SEL_OFF_Val << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Alarm Disabled Position  */
#define RTC_MODE2_MASK_SEL_SS                                                                                          \
        (RTC_MODE2_MASK_SEL_SS_Val << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Match seconds only Position  */
#define RTC_MODE2_MASK_SEL_MMSS                                                                                        \
        (                                                                                                              \
                RTC_MODE2_MASK_SEL_MMSS_Val                                                                            \
                << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Match seconds and minutes only Position  */
#define RTC_MODE2_MASK_SEL_HHMMSS                                                                                      \
        (                                                                                                              \
                RTC_MODE2_MASK_SEL_HHMMSS_Val                                                                          \
                << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Match seconds, minutes, and hours only Position  */
#define RTC_MODE2_MASK_SEL_DDHHMMSS                                                                                    \
        (RTC_MODE2_MASK_SEL_DDHHMMSS_Val                                                                               \
         << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Match seconds, minutes, hours, and days only Position  */
#define RTC_MODE2_MASK_SEL_MMDDHHMMSS                                                                                  \
        (RTC_MODE2_MASK_SEL_MMDDHHMMSS_Val << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Match seconds, minutes,      \
                                                                         hours, days, and months only Position  */
#define RTC_MODE2_MASK_SEL_YYMMDDHHMMSS                                                                                \
        (RTC_MODE2_MASK_SEL_YYMMDDHHMMSS_Val << RTC_MODE2_MASK_SEL_Pos) /* (RTC_MODE2_MASK) Match seconds, minutes,    \
                                                                           hours, days, months, and years Position  */
#define RTC_MODE2_MASK_Msk _UINT8_(0x07) /* (RTC_MODE2_MASK) Register Mask  */


