ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/rtc.h
/** \brief RTC register offsets definitions */
#define RTC_MODE0_CTRL_REG_OFST _UINT32_(0x00) /* (RTC_MODE0_CTRL) MODE0 Control Offset */
#define RTC_MODE1_CTRL_REG_OFST _UINT32_(0x00) /* (RTC_MODE1_CTRL) MODE1 Control Offset */
#define RTC_MODE2_CTRL_REG_OFST _UINT32_(0x00) /* (RTC_MODE2_CTRL) MODE2 Control Offset */
#define RTC_READREQ_REG_OFST _UINT32_(0x02) /* (RTC_READREQ) Read Request Offset */
#define RTC_MODE0_EVCTRL_REG_OFST _UINT32_(0x04) /* (RTC_MODE0_EVCTRL) MODE0 Event Control Offset */
#define RTC_MODE1_EVCTRL_REG_OFST _UINT32_(0x04) /* (RTC_MODE1_EVCTRL) MODE1 Event Control Offset */
#define RTC_MODE2_EVCTRL_REG_OFST _UINT32_(0x04) /* (RTC_MODE2_EVCTRL) MODE2 Event Control Offset */
#define RTC_MODE0_INTENCLR_REG_OFST _UINT32_(0x06) /* (RTC_MODE0_INTENCLR) MODE0 Interrupt Enable Clear Offset */
#define RTC_MODE1_INTENCLR_REG_OFST _UINT32_(0x06) /* (RTC_MODE1_INTENCLR) MODE1 Interrupt Enable Clear Offset */
#define RTC_MODE2_INTENCLR_REG_OFST _UINT32_(0x06) /* (RTC_MODE2_INTENCLR) MODE2 Interrupt Enable Clear Offset */
#define RTC_MODE0_INTENSET_REG_OFST _UINT32_(0x07) /* (RTC_MODE0_INTENSET) MODE0 Interrupt Enable Set Offset */
#define RTC_MODE1_INTENSET_REG_OFST _UINT32_(0x07) /* (RTC_MODE1_INTENSET) MODE1 Interrupt Enable Set Offset */
#define RTC_MODE2_INTENSET_REG_OFST _UINT32_(0x07) /* (RTC_MODE2_INTENSET) MODE2 Interrupt Enable Set Offset */
#define RTC_MODE0_INTFLAG_REG_OFST _UINT32_(0x08) /* (RTC_MODE0_INTFLAG) MODE0 Interrupt Flag Status and Clear Offset  \
                                                   */
#define RTC_MODE1_INTFLAG_REG_OFST _UINT32_(0x08) /* (RTC_MODE1_INTFLAG) MODE1 Interrupt Flag Status and Clear Offset  \
                                                   */
#define RTC_MODE2_INTFLAG_REG_OFST _UINT32_(0x08) /* (RTC_MODE2_INTFLAG) MODE2 Interrupt Flag Status and Clear Offset  \
                                                   */
#define RTC_STATUS_REG_OFST _UINT32_(0x0A) /* (RTC_STATUS) Status Offset */
#define RTC_DBGCTRL_REG_OFST _UINT32_(0x0B) /* (RTC_DBGCTRL) Debug Control Offset */
#define RTC_FREQCORR_REG_OFST _UINT32_(0x0C) /* (RTC_FREQCORR) Frequency Correction Offset */
#define RTC_MODE0_COUNT_REG_OFST _UINT32_(0x10) /* (RTC_MODE0_COUNT) MODE0 Counter Value Offset */
#define RTC_MODE1_COUNT_REG_OFST _UINT32_(0x10) /* (RTC_MODE1_COUNT) MODE1 Counter Value Offset */
#define RTC_MODE2_CLOCK_REG_OFST _UINT32_(0x10) /* (RTC_MODE2_CLOCK) MODE2 Clock Value Offset */
#define RTC_MODE1_PER_REG_OFST _UINT32_(0x14) /* (RTC_MODE1_PER) MODE1 Counter Period Offset */
#define RTC_MODE0_COMP_REG_OFST _UINT32_(0x18) /* (RTC_MODE0_COMP) MODE0 Compare n Value Offset */
#define RTC_MODE1_COMP_REG_OFST _UINT32_(0x18) /* (RTC_MODE1_COMP) MODE1 Compare n Value Offset */
#define RTC_MODE1_COMP0_REG_OFST _UINT32_(0x18) /* (RTC_MODE1_COMP0) MODE1 Compare n Value Offset */
#define RTC_MODE1_COMP1_REG_OFST _UINT32_(0x1A) /* (RTC_MODE1_COMP1) MODE1 Compare n Value Offset */
#define RTC_MODE2_ALARM_REG_OFST _UINT32_(0x18) /* (RTC_MODE2_ALARM) MODE2_ALARM Alarm n Value Offset */
#define RTC_MODE2_MASK_REG_OFST _UINT32_(0x1C) /* (RTC_MODE2_MASK) MODE2_ALARM Alarm n Mask Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief RTC register API structure */
typedef struct { /* Real-Time Counter */
        __IO uint16_t RTC_CTRL; /**< Offset: 0x00 (R/W  16) MODE0 Control */
        __IO uint16_t RTC_READREQ; /**< Offset: 0x02 (R/W  16) Read Request */
        __IO uint16_t RTC_EVCTRL; /**< Offset: 0x04 (R/W  16) MODE0 Event Control */
        __IO uint8_t RTC_INTENCLR; /**< Offset: 0x06 (R/W  8) MODE0 Interrupt Enable Clear */
        __IO uint8_t RTC_INTENSET; /**< Offset: 0x07 (R/W  8) MODE0 Interrupt Enable Set */
        __IO uint8_t RTC_INTFLAG; /**< Offset: 0x08 (R/W  8) MODE0 Interrupt Flag Status and Clear */
        __I uint8_t Reserved1[0x01];
        __IO uint8_t RTC_STATUS; /**< Offset: 0x0A (R/W  8) Status */
        __IO uint8_t RTC_DBGCTRL; /**< Offset: 0x0B (R/W  8) Debug Control */
        __IO uint8_t RTC_FREQCORR; /**< Offset: 0x0C (R/W  8) Frequency Correction */
        __I uint8_t Reserved2[0x03];
        __IO uint32_t RTC_COUNT; /**< Offset: 0x10 (R/W  32) MODE0 Counter Value */
        __I uint8_t Reserved3[0x04];
        __IO uint32_t RTC_COMP; /**< Offset: 0x18 (R/W  32) MODE0 Compare n Value */
} rtc_mode0_registers_t;

/** \brief RTC register API structure */
typedef struct { /* Real-Time Counter */
        __IO uint16_t RTC_CTRL; /**< Offset: 0x00 (R/W  16) MODE1 Control */
        __IO uint16_t RTC_READREQ; /**< Offset: 0x02 (R/W  16) Read Request */
        __IO uint16_t RTC_EVCTRL; /**< Offset: 0x04 (R/W  16) MODE1 Event Control */
        __IO uint8_t RTC_INTENCLR; /**< Offset: 0x06 (R/W  8) MODE1 Interrupt Enable Clear */
        __IO uint8_t RTC_INTENSET; /**< Offset: 0x07 (R/W  8) MODE1 Interrupt Enable Set */
        __IO uint8_t RTC_INTFLAG; /**< Offset: 0x08 (R/W  8) MODE1 Interrupt Flag Status and Clear */
        __I uint8_t Reserved1[0x01];
        __IO uint8_t RTC_STATUS; /**< Offset: 0x0A (R/W  8) Status */
        __IO uint8_t RTC_DBGCTRL; /**< Offset: 0x0B (R/W  8) Debug Control */
        __IO uint8_t RTC_FREQCORR; /**< Offset: 0x0C (R/W  8) Frequency Correction */
        __I uint8_t Reserved2[0x03];
        __IO uint16_t RTC_COUNT; /**< Offset: 0x10 (R/W  16) MODE1 Counter Value */
        __I uint8_t Reserved3[0x02];
        __IO uint16_t RTC_PER; /**< Offset: 0x14 (R/W  16) MODE1 Counter Period */
        __I uint8_t Reserved4[0x02];
        __IO uint16_t RTC_COMP[2]; /**< Offset: 0x18 (R/W  16) MODE1 Compare n Value */
} rtc_mode1_registers_t;

/** \brief RTC register API structure */
typedef struct { /* Real-Time Counter */
        __IO uint16_t RTC_CTRL; /**< Offset: 0x00 (R/W  16) MODE2 Control */
        __IO uint16_t RTC_READREQ; /**< Offset: 0x02 (R/W  16) Read Request */
        __IO uint16_t RTC_EVCTRL; /**< Offset: 0x04 (R/W  16) MODE2 Event Control */
        __IO uint8_t RTC_INTENCLR; /**< Offset: 0x06 (R/W  8) MODE2 Interrupt Enable Clear */
        __IO uint8_t RTC_INTENSET; /**< Offset: 0x07 (R/W  8) MODE2 Interrupt Enable Set */
        __IO uint8_t RTC_INTFLAG; /**< Offset: 0x08 (R/W  8) MODE2 Interrupt Flag Status and Clear */
        __I uint8_t Reserved1[0x01];
        __IO uint8_t RTC_STATUS; /**< Offset: 0x0A (R/W  8) Status */
        __IO uint8_t RTC_DBGCTRL; /**< Offset: 0x0B (R/W  8) Debug Control */
        __IO uint8_t RTC_FREQCORR; /**< Offset: 0x0C (R/W  8) Frequency Correction */
        __I uint8_t Reserved2[0x03];
        __IO uint32_t RTC_CLOCK; /**< Offset: 0x10 (R/W  32) MODE2 Clock Value */
        __I uint8_t Reserved3[0x04];
        __IO uint32_t RTC_ALARM; /**< Offset: 0x18 (R/W  32) MODE2_ALARM Alarm n Value */
        __IO uint8_t RTC_MASK; /**< Offset: 0x1C (R/W  8) MODE2_ALARM Alarm n Mask */
} rtc_mode2_registers_t;

/** \brief RTC hardware registers */
typedef union { /* Real-Time Counter */
        rtc_mode0_registers_t MODE0; /**< 32-bit Counter with Single 32-bit Compare */
        rtc_mode1_registers_t MODE1; /**< 16-bit Counter with Two 16-bit Compares */
        rtc_mode2_registers_t MODE2; /**< Clock/Calendar with Alarm */
} rtc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_RTC_COMPONENT_H_ */
